In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.random.randn(8,3),columns=['A','B','C'])

In [4]:
df.columns = [x.lower() for x in df.columns]
df

          a         b         c
0  2.330215  1.053319 -1.854889
1 -0.865158  0.672130  0.962583
2 -0.120378 -1.040279  0.110077
3  0.176398  1.075212  0.109871
4 -0.681188  1.061672  0.908492
5 -1.138284 -0.571855 -0.348817
6  0.457130 -0.525979  0.218861
7 -0.717190 -0.298152 -0.552608

In [5]:
df.a.array

<PandasArray>
[  2.3302150638324473,  -0.8651580730478569, -0.12037811686380413,
  0.17639765613575145,  -0.6811882253235633,  -1.1382844862502008,
  0.45713025779852207,    -0.71718975030298]
Length: 8, dtype: float64

In [6]:
data = np.random.randint(0,7,size=50)
data

array([6, 4, 4, 6, 1, 0, 5, 4, 2, 4, 4, 3, 4, 0, 5, 1, 1, 2, 5, 6, 4, 2,
       2, 5, 5, 0, 0, 4, 3, 0, 2, 1, 5, 5, 0, 6, 0, 5, 0, 4, 5, 0, 4, 4,
       1, 2, 5, 1, 6, 1])

In [7]:
s = pd.Series(data)

In [8]:
s.value_counts()

4    11
5    10
0     9
1     7
2     6
6     5
3     2
dtype: int64

In [9]:
s5 = pd.Series([1,1,3,3,3,5,5,7,7,7])

In [10]:
s5.mode()

0    3
1    7
dtype: int64

In [17]:
df5 = pd.DataFrame({'A': np.random.randint(0,7,size=50), 'B': np.random.randint(-10,15,size=50)})
df5.mode()

   A    B
0  2 -4.0
1  4  NaN

In [18]:
s = pd.Series(np.random.randn(5), index=['a','b','c','d','e'])
s

a    0.625661
b   -0.712965
c    1.107797
d    0.972118
e    0.256748
dtype: float64

In [20]:
s.reindex(['e','b','f','d'])

e    0.256748
b   -0.712965
f         NaN
d    0.972118
dtype: float64

In [22]:
df = pd.DataFrame({
    'one': pd.Series(np.random.randn(3), index=['a','b','c']),
    'two': pd.Series(np.random.randn(4), index=['a','b','c','d']),
    'three': pd.Series(np.random.randn(3), index=['b','c','d'])
})

df.reindex(index=['c','f','b'], columns=['three','two','one'])

      three       two       one
c -0.868646 -0.477321 -1.969571
f       NaN       NaN       NaN
b -1.663060 -0.189486 -0.304875

In [23]:
df.reindex(['c','f','b'], axis='index')

        one       two     three
c -1.969571 -0.477321 -0.868646
f       NaN       NaN       NaN
b -0.304875 -0.189486 -1.663060

In [24]:
rs = s.reindex(df.index)

In [25]:
rs

a    0.625661
b   -0.712965
c    1.107797
d    0.972118
dtype: float64

In [26]:
df

        one       two     three
a -0.964196  1.235500       NaN
b -0.304875 -0.189486 -1.663060
c -1.969571 -0.477321 -0.868646
d       NaN -3.080978 -1.368294

In [27]:
df.drop(['a','d'],axis=0)

        one       two     three
b -0.304875 -0.189486 -1.663060
c -1.969571 -0.477321 -0.868646

In [28]:
df.drop(['one'], axis=1)

        two     three
a  1.235500       NaN
b -0.189486 -1.663060
c -0.477321 -0.868646
d -3.080978 -1.368294

In [29]:
s

a    0.625661
b   -0.712965
c    1.107797
d    0.972118
e    0.256748
dtype: float64

In [30]:
s.rename(str.upper)

A    0.625661
B   -0.712965
C    1.107797
D    0.972118
E    0.256748
dtype: float64

In [31]:
df.rename(columns={'one':'foo', 'two':'bar'}, index={'a':'apple', 'b':'banana', 'd':'durian'})

             foo       bar     three
apple  -0.964196  1.235500       NaN
banana -0.304875 -0.189486 -1.663060
c      -1.969571 -0.477321 -0.868646
durian       NaN -3.080978 -1.368294

In [33]:
df.rename({'one':'foo', 'two':'bar'}, axis='columns')
#df.rename({'a':'apple', 'b':'banana', 'd':'durian'}, axis='index')

        foo       bar     three
a -0.964196  1.235500       NaN
b -0.304875 -0.189486 -1.663060
c -1.969571 -0.477321 -0.868646
d       NaN -3.080978 -1.368294

In [34]:
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))

In [35]:
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [36]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [37]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [38]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [39]:
s.dt.dayofweek

0    1
1    2
2    3
3    4
dtype: int64

In [40]:
stz = s.dt.tz_localize('US/Eastern')

In [41]:
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [42]:
stz.dt.tz

In [43]:
s.dt.tz_localize('UTC').dt.tz_convert('US/Eastern')

0   2013-01-01 04:10:12-05:00
1   2013-01-02 04:10:12-05:00
2   2013-01-03 04:10:12-05:00
3   2013-01-04 04:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [45]:
s = pd.Series(['A', 'B', 'C','Aaba','Baca',np.nan,'CABA','dog','cat'], dtype="string")

In [46]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [47]:
df

        one       two     three
a -0.964196  1.235500       NaN
b -0.304875 -0.189486 -1.663060
c -1.969571 -0.477321 -0.868646
d       NaN -3.080978 -1.368294

In [51]:
unsorted_df = df.reindex(index=['a','d','c','b'], columns=['three', 'two', 'one'])

In [52]:
unsorted_df

      three       two       one
a       NaN  1.235500 -0.964196
d -1.368294 -3.080978       NaN
c -0.868646 -0.477321 -1.969571
b -1.663060 -0.189486 -0.304875

In [53]:
unsorted_df.sort_index()

      three       two       one
a       NaN  1.235500 -0.964196
b -1.663060 -0.189486 -0.304875
c -0.868646 -0.477321 -1.969571
d -1.368294 -3.080978       NaN

In [54]:
unsorted_df.sort_index(ascending=False)

      three       two       one
d -1.368294 -3.080978       NaN
c -0.868646 -0.477321 -1.969571
b -1.663060 -0.189486 -0.304875
a       NaN  1.235500 -0.964196

In [55]:
unsorted_df.sort_index(axis=1)

        one     three       two
a -0.964196       NaN  1.235500
d       NaN -1.368294 -3.080978
c -1.969571 -0.868646 -0.477321
b -0.304875 -1.663060 -0.189486

In [56]:
unsorted_df['three'].sort_index()

a         NaN
b   -1.663060
c   -0.868646
d   -1.368294
Name: three, dtype: float64

In [57]:
df1 = pd.DataFrame({
    'one':[2,1,1,1],
    'two':[1,3,2,4],
    'three':[5,4,3,2]
})

df1.sort_values(by='two')

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

In [58]:
df1[['one','two','three']].sort_values(by=['one','two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

In [59]:
s[2] = np.nan

In [60]:
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2    <NA>
5    <NA>
dtype: string

In [61]:
s.sort_values(na_position='first')

2    <NA>
5    <NA>
0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
dtype: string

In [62]:
idx = pd.MultiIndex.from_tuples([('a',1),('a',2),('a',2),('b',2),('b',1),('b',1)])

In [63]:
idx.names=['first','second']

In [65]:
df_multi = pd.DataFrame({'A':np.arange(6,0,-1)},index=idx)

In [66]:
df_multi

              A
first second
a     1       6
      2       5
      2       4
b     2       3
      1       2
      1       1

In [67]:
df_multi.sort_values(by=['second','A'])

              A
first second
b     1       1
      1       2
a     1       6
b     2       3
a     2       4
      2       5